package Example;

public class BitwiseOperation {

	public static void main(String[] args) {
		
		// 1. 비트연산자
		// ~ 연산자 : 비트를 0이면 1로, 1이면 0으로 반전시킨다.
		System.out.println(~9); // 0000 0000 0000 0000 0000 0000 0000 1001 ==> 1111 1111 1111 1111 1111 1111 1111 0110
		
		
		// | 연산자 : 두 비트 중 하나라도 1이면 1을 반환
		System.out.println(9|30); // 01001(2) = 9 | 11110(2) = 30 ==> 예상 출력 11111(2) 이므로 31
		System.out.println(20|1); // 10100(2) = 20 | 00001(2) = 1 ==> 예상 출력 10101(2) 이므로 21
		
		
		// & 연산자 : 두 비트 모두 1일 때 1 반환
		System.out.println(9&15); //0000 1001 & 0000 1111 ==> 0000 1001 이므로 9
		
		
		// ^ 연산자 : 두 비트가 다를 때 1을 반환
		System.out.println(9^15); // 0000 1001 ^ 0000 1111 ==> 0000 0110 이므로 6
		

	}

}
